#pragma once
#include "SDK/Basic.hpp"
#include "SDK/CoreUObject_classes.hpp"
#include "SDK/CoreUObject_structs.hpp"


namespace TFD
{
	using namespace SDK;

	extern uintptr_t BASE;
	extern uintptr_t SIZE;

	static const char* GNamesSig = "\x4C\x8D\x35\x00\x00\x00\x00\x0F\x95\x44\x24\x2C\x48\x2B\xCB";
	static const char* GNamesMask = "xxx????xxxxxxx";

	static const char* NGSSig = "\x48\x8B\x45\xA0\x0F\x10\x05\x00\x00\x00\x00\x41\xBE\x00\x02\x00\x00\x0F\x11\x00\xF2\x0F\x10\x0D\x00\x00\x00\x00\xF2";
	static const char* NGSMask = "xxxxxxx????xxxxxxxxxxxxx????x";
	
	static const char* UMPOSCGetAccountSig = "\x40\x53\x48\x83\xEC\x20\x48\x8B\xD9\xE8\x00\x00\x00\x00\x48\x8B\xC8\x48\x8B\x10\xFF\x92\x18\x03";
	static const char* UMPOSCGetAccountMask = "xxxxxxxxxx????xxxxxxxxxx";
	typedef UObject* (__fastcall* tUMPOSCGetAccount)(UObject* PrivateOnlineServiceComponent);
	extern tUMPOSCGetAccount native_GetUM1Account;

	//void __fastcall UM1SpeedHackDetectorSubSystem::SpeedHackDetecting(UM1SpeedHackDetectorSubSystem* this,float InDeltaTime)
	typedef void(__fastcall* tSpeedHackDetecting)(void* This, float InDeltaTime);
	extern tSpeedHackDetecting native_SpeedHackDetecting;
	static const char* SpeedHackDetecting_Sig = "\x40\x53\x56\x41\x54\x41\x56\x48\x83\xEC\x00\xF3";
	static const char* SpeedHackDetecting_Mask = "xxxxxxxxxx?x";


	// FString *__fastcall AM1Character::GetStringId(AM1Character *this, FString *result)

	//static const char* ActorMiniGamePlayMask = "xxxxxxxxxx????xxxx????xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx";
	// 40 53 48 83 EC 30 48 8B D9 E8 ?? ?? ?? ?? 48 8B CB E8 ?? ?? ?? ?? 48 8B 03 48 8D 54 24 20 48 8B CB C6 44 24 20 00 48 C7 44 24 28 00 00 00 00 FF 90 08 07 00 00 48 8B

	//static const char* CanInteractSig = "\x48\x89\x5C\x24\x08\x48\x89\x74\x24\x10\x57\x48\x83\xEC\x20\x83\xB9\x30\x04\x00\x00\x00\x48\x8B\xF2";
	//static const char* CanInteractMask = "xxxxxxxxxxxxxxxxxxxxxxxxx";

	//static const char* NoSpreadSig = "\x48\x8B\x86\xD0\x00\x00\x00\xF3\x0F\x11\xBE\x08";
	//static const char* NoSpreadMask = "xxxxxxxxxxxx";
	//static uint8_t NoSpreadOriginal[8] = { 0xF3, 0x41, 0x0F, 0x5D, 0xC4, 0x0F, 0x28, 0xF8 };
	//static uint8_t NoSpreadCheat[8] = { 0xF3, 0x45, 0x0F, 0x5C, 0xC9, 0x90, 0x90, 0x90 };
	//extern uint8_t* NoSpreadAddress;

	//static const char* NoRecoilSig = "\x84\xC0\x74\x00\x48\x8B\xBD\xF0\x00\x00\x00\x8B\x9D";
	//static const char* NoRecoilMask = "xxx?xxxxxxxxx";
	//extern uint8_t* NoRecoilAddress;

	//static const char* RapidFireSig = "\x72\x00\xF3\x0F\x10\x87\x00\x00\x00\x00\x48";
	//static const char* RapidFireMask = "x?xxxx????x";
	//extern uint8_t* RapidFireAddress;

	//static uint8_t bytes_Recoil[2] = { 0x74, 0x75 };
	//static uint8_t bytes_RapidFire[2] = { 0x72, 0x77 };

	enum Init_Code
	{
		Success,
		FatalError,
		ModuleBase,
		GNames,
		GObjects,
		PostRender
	};

	Init_Code InitSDK(int procid, uintptr_t base, uintptr_t size);

	static ULONG64* GetPostRender(void* vp);
	bool MemoryCompare(const BYTE* bData, const BYTE* bSig, const char* szMask);
	uintptr_t SearchSignature(int procID, uintptr_t base, uintptr_t size, const char* sig, const char* mask);
	uintptr_t SearchForGObjects(uintptr_t base);
	void SearchForGWorld(uintptr_t base, uintptr_t size);
	template<typename T>
	T* FindAlignedValueInProcess(T Value, const std::string& Sectionname = ".data", int32_t Alignment = alignof(T), bool bSearchAllSections = false);
	template<typename T>
	T* FindAlignedValueInProcessInRange(T Value, int32_t Alignment, uintptr_t StartAddress, uint32_t Range);
	bool IsAddressValidGObjects(const uintptr_t Address);
	std::pair<uintptr_t, DWORD> GetSectionByName(uintptr_t ImageBase, const std::string& ReqestedSectionName);
	bool IsBadReadPtr(const void* p);


	//typedef UFunction* (__fastcall* tFindFunctionChecked)(UObject* ThisObject, FName InName, EIncludeSuperFlag IncludeSuper);
	//extern tFindFunctionChecked native_FindFunctionChecked;

	//typedef void (__fastcall* tInitCheatManager)(UObject* ThisObject);
	//extern tInitCheatManager native_InitCheatManager;

	//                      AM1FieldInteractableActorMiniGame*    -V
	//typedef void(__fastcall* tActorMiniGameBeginPlay)(UObject* ThisObject);
	//extern tActorMiniGameBeginPlay native_ActorMiniGameBeginPlay;

	//typedef bool(__fastcall* tInteractableActorCanActivate)(UObject* ThisObject, UObject* InPC);
	//extern tInteractableActorCanActivate native_oInteractableActorCanActivate;
	//bool hook_InteractableActorCanActivate(UObject* ThisObj, UObject* InPC);


	const struct FChunkedFixedUObjectArrayLayout
	{
		const int ObjectsOffset = 0x0;
		const int MaxElementsOffset = 0x10;
		const int NumElementsOffset = 0x14;
		const int MaxChunksOffset = 0x18;
		const int NumChunksOffset = 0x1C;
	};

	// 0x1010 (0x1038 - 0x0028)
	class UEngine : public UObject
	{
	public:
		uint8 Pad_ConsoleClass[0xF0]; // 0x0028
		//class UFont* SmallFont; // 0x0058(0x0008)
		TSubclassOf<class UConsole> ConsoleClass; // 0x0118(0x0008)
		uint8 Pad_GameViewport[0x8F8]; // 0x0120
		class UGameViewportClient* GameViewport; // 0x0A18(0x0008)
		uint8 Pad_UEngine[0x618]; // 0x0A20
	public:
		static class UEngine* GetEngine();

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"Engine">();
		}
		static class UEngine* GetDefaultObj()
		{
			return GetDefaultObjImpl<UEngine>();
		}
	};
	// 0x08F8 (0x0920 - 0x0028)
	class UWorld final : public UObject
	{
	public:
		uint8 Pad_PersistentLevel[0x8]; // 0x0028 8
		class ULevel* PersistentLevel; // 0x0030(0x0008) Need
		uint8 Pad_GameState[0x128];	// 0x0038
		class AGameStateBase* GameState; // 0x0160(0x0008) Need
		uint8 Pad_Levels[0x10]; // 0x0168
		TArray<class ULevel*> Levels; // 0x0178(0x0010) Need
		uint8  Pad_OwningGameInstance[0x38]; // 0x0188
		class UGameInstance* OwningGameInstance; // 0x01C0(0x0008) Need
		uint8  Pad_UWorld[0x758]; // 0x01C8
	public:
		static class UWorld* GetWorld();

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"World">();
		}
		static class UWorld* GetDefaultObj()
		{
			return GetDefaultObjImpl<UWorld>();
		}
	};

	typedef void(__fastcall* tCreateCheatWidget)(UWorld* World);
	extern tCreateCheatWidget native_CreateCheatWidget;

	// 0x0220 (0x0248 - 0x0028)
	class AActor : public UObject
	{
	public:
		uint8                                         Pad_Children[0x118]; // 0x28 118
		TArray<class AActor*>                         Children; // 0x0140(0x0010) Need
		uint8                                         Pad_AActor_Class[0xF8]; // 0x150 F8

		bool K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		float GetDistanceTo(const class AActor* OtherActor) const;
		struct FVector K2_GetActorLocation() const;
		struct FRotator K2_GetActorRotation() const;
		void GetActorBounds(bool bOnlyCollidingComponents, struct FVector* Origin, struct FVector* BoxExtent, bool bIncludeFromChildActors) const;
	};

	// 0x02C8 (0x02F0 - 0x0028)
	class ULevel final : public UObject
	{
	public:
		uint8  Pad_Actors[0x70]; // 0x28 70
		class TArray<class TFD::AActor*> Actors; // 0x0098(0x0010)
		uint8  Pad_WorldSettings[0x1C8]; // 0x00A8
		class AWorldSettings* WorldSettings; // 0x0270(0x0008)
		uint8  Pad_ULevel[0x78]; // 0x278
		
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"Level">();
		}
		static class ULevel* GetDefaultObj()
		{
			return GetDefaultObjImpl<ULevel>();
		}
	};
	

	// 0x0000 (0x0248 - 0x0248)
	class AInfo : public AActor
	{
	};

	// 0x0058 (0x02A0 - 0x0248)
	class AGameStateBase : public AInfo
	{
	public:
		uint8 Pad_AGameStateBase_Class[0x58]; // 0x248 58
	};

	// 0x0008 (0x0030 - 0x0028)
	class USubsystem : public UObject
	{
	public:
		uint8 Pad_USubsystem[0x8];
	};

	// 0x0000 (0x0030 - 0x0030)
	class UGameInstanceSubsystem : public USubsystem
	{
	};

	// Predefined struct FScriptDelegate
	// 0x0010 (0x0010 - 0x0000)
	struct FScriptDelegate
	{
	public:
		FWeakObjectPtr                                Object;                                            // 0x0000(0x0008)(NOT AUTO-GENERATED PROPERTY)
		FName                                         FunctionName;                                      // 0x0008(0x0008)(NOT AUTO-GENERATED PROPERTY)
	};

	// Predefined struct TDelegate
	// 0x0010 (0x0010 - 0x0000)
	template<typename FunctionSignature>
	class TDelegate
	{
	public:
		struct InvalidUseOfTDelegate                  TemplateParamIsNotAFunctionSignature;              // 0x0000(0x0000)(NOT AUTO-GENERATED PROPERTY)
		uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
	};

	// Predefined struct TDelegate<Ret(Args...)>
	// 0x0010 (0x0010 - 0x0000)
	template<typename Ret, typename... Args>
	class TDelegate<Ret(Args...)>
	{
	public:
		FScriptDelegate                               BoundFunction;                                     // 0x0000(0x0010)(NOT AUTO-GENERATED PROPERTY)
	};

	// Predefined struct TMulticastInlineDelegate
	// 0x0010 (0x0010 - 0x0000)
	template<typename FunctionSignature>
	class TMulticastInlineDelegate
	{
	public:
		struct InvalidUseOfTMulticastInlineDelegate   TemplateParamIsNotAFunctionSignature;              // 0x0000(0x0010)(NOT AUTO-GENERATED PROPERTY)
	};

	// Predefined struct TMulticastInlineDelegate<Ret(Args...)>
	// 0x0000 (0x0000 - 0x0000)
	template<typename Ret, typename... Args>
	class TMulticastInlineDelegate<Ret(Args...)>
	{
	public:
		TArray<FScriptDelegate>                       InvocationList;                                    // 0x0000(0x0010)(NOT AUTO-GENERATED PROPERTY)
	};

	struct FSubsystemCollectionBase
	{
		void* __vftable;										// 0x00
		TMap<SDK::UClass*, USubsystem*> SubsystemMap;				// 0x08
		TMap<SDK::UClass*, TArray<USubsystem*>> SubsystemArrayMap;	// 0x58
		SDK::UClass* BaseType;
		SDK::UObject* Outer;
		bool bPopulating;										// 0xB8
		uint8 Pad_FSubsystemCollectionBase[0x7];				// 0xB9
	};

	// 0x0008 (0x0008 - 0x0000)
	struct FDelegateHandle
	{
		uint64 ID;
	};
	// 0x000C (0x000C - 0x0000)
	struct FCachedMaxCapacity
	{
		int CachedCapacity;
		FDelegateHandle StatChangedEventDelegateHandle;
	};

	// 0x0198 (0x01C0 - 0x0028)
	class UGameInstance : public UObject
	{
	public:
		uint8 Pad_LocalPlayers[0x10]; // 0x0028
		TArray<class ULocalPlayer*>  LocalPlayers; // 0x0038(0x0010)
		uint8 Pad_SubsystemCollection[0xB8]; // 0x0048
		struct FSubsystemCollectionBase SubsystemCollection; // 0x100 (0x1C0)
	};

	static_assert(sizeof(FSubsystemCollectionBase) == 0xC0, "Wrong size");

	// 0x0020 (0x0048 - 0x0028)
	class UPlayer : public UObject
	{
	public:
		uint8 Pad_PlayerController[0x8]; // 0x0028
		class APlayerController* PlayerController; // 0x0030(0x0008)
		uint8 Pad_UPlayer_Class[0x10]; // 0x0038

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"Player">();
		}
		static class UPlayer* GetDefaultObj()
		{
			return GetDefaultObjImpl<UPlayer>();
		}
	};

	// 0x0010 (0x0038 - 0x0028)
	class UScriptViewportClient : public UObject
	{
	public:
		uint8 Pad_UScriptViewportClient_Class[0x10]; // 0x0028(0x0010)
	};
	// 0x0378 (0x03B0 - 0x0038)
	class UGameViewportClient : public UScriptViewportClient
	{
	public:
		uint8 Pad_ViewportConsole[0x8]; // 0x0038
		class UConsole* ViewportConsole; // 0x0040(0x0008)
		uint8 Pad_UGameViewportClient[0x368]; // 0x0048
	};
	// 0x0230 (0x0278 - 0x0048)
	class ULocalPlayer : public UPlayer
	{
	public:
		uint8 Pad_ViewportClient[0x30]; // 0x0048
		class UGameViewportClient* ViewportClient; // 0x0078(0x0008)
		uint8 Pad_ULocalPlayer_Class[0x1F8]; // 0x80 1F8
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"LocalPlayer">();
		}
	};
	// 0x0118 (0x0360 - 0x0248)
	class APlayerState : public AInfo
	{
	public:
		uint8 Pad_APlayerState_Class[0x118];
	};
	// 0x0088 (0x03E8 - 0x0360)
	class AM1PlayerState final : public APlayerState
	{
	public:
		class UM1MissionControlComponent* MissionControlComponent; // 0x0360(0x0008)
		uint8 Pad_AM1PlayerState_Class[0x80];                    // 0x0368

	public:
		void ServerCheatSetIsCreator(bool InbCreator);

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1PlayerState">();
		}
	};

	// 0x0088 (0x02D0 - 0x0248)
	class AController : public AActor
	{
	public:
		uint8 Pad_PlayerState[0x8]; // 0x0248(0x0008)
		class APlayerState* PlayerState; // 0x0250(0x0008)
		uint8 Pad_Pawn[0x30]; // 0x258
		class APawn* Pawn; // 0x0288(0x0008)
		uint8 Pad_Character[0x8]; // 0x290 8
		class ACharacter* Character; // 0x0298(0x0008)
		uint8 Pad_AController_Class[0x30]; // 0x2A0 30

		void SetControlRotation(const struct FRotator& NewRotation);
		bool LineOfSightTo(const class AActor* Other, const struct FVector& ViewPoint, bool bAlternateChecks) const;

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"Controller">();
		}
		static class AController* GetDefaultObj()
		{
			return GetDefaultObjImpl<AController>();
		}
	};
	// 0x36E8 (0x3930 - 0x0248)
	class APlayerCameraManager : public AActor
	{
	public:
		uint8 Pad_APlayerCameraManager_Class[0x36E8]; // 0x0248
	public:
		struct FVector GetCameraLocation() const;
		struct FRotator GetCameraRotation() const;
		void StopAllCameraShakes(bool bImmediately);

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"PlayerCameraManager">();
		}
	};
	// 0x04B8 (0x0788 - 0x02D0)
	class APlayerController : public AController
	{
	public:
		uint8 Pad_Player[0x8]; // 0x02D0
		class UPlayer* Player; // 0x02D8(0x0008)
		uint8 Pad_PlayerCameraManager[0x10]; // 0x02E0
		class APlayerCameraManager* PlayerCameraManager; // 0x02F0(0x0008)
		uint8 Pad_CheatManager[0x78]; // 0x2F8
		class UCheatManager* CheatManager;// 0x0370(0x0008)
		TSubclassOf<class UCheatManager> CheatClass;// 0x0378(0x0008)
		uint8 Pad_APlayerController_Class[0x408]; // 0x380

		

		bool GetMousePosition(float* LocationX, float* LocationY) const;
		void EnableCheats();

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"PlayerController">();
		}
	};

	struct alignas(0x08) FKey final
	{
	public:
		class FName                                   KeyName;                                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
	};

	struct FVector_NetQuantize : public FVector
	{
		using FVector::FVector;
	};

	struct FVector_NetQuantizeNormal : public FVector
	{
		using FVector::FVector;
	};

	struct FActorInstanceHandle final
	{
	public:
		TWeakObjectPtr<class AActor>                  Actor;
		uint8                                         Pad_99[0x10];
	};

	struct FHitResult final
	{
	public:
		int32                                         FaceIndex;
		float                                         Time;
		float                                         Distance;
		struct FVector                   Location;
		struct FVector                   ImpactPoint;
		struct FVector            Normal;
		struct FVector             ImpactNormal;
		struct FVector                   TraceStart;
		struct FVector                   TraceEnd;
		float                                         PenetrationDepth;
		int32                                         MyItem;
		int32                                         Item;
		uint8                                         ElementIndex;
		uint8                                         bBlockingHit : 1;
		uint8                                         bStartPenetrating : 1;
		uint8                                         Pad_9A[0x2];
		TWeakObjectPtr<class UPhysicalMaterial>       PhysMaterial;
		struct FActorInstanceHandle                   HitObjectHandle;
		TWeakObjectPtr<class UPrimitiveComponent>     Component;
		class FName                                   BoneName;
		class FName                                   MyBoneName;
	};

	// 0x0128 (0x0150 - 0x0028)
	class UInputSettings final : public UObject
	{
	public:
		uint8 Pad_ConsoleKeys[0x118]; // 0x0028
		TArray<struct FKey> ConsoleKeys; // 0x0140(0x0010)

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"InputSettings">();
		}
		static class UInputSettings* GetDefaultObj()
		{
			return GetDefaultObjImpl<UInputSettings>();
		}
	};

	// 0x0000 (0x0028 - 0x0028)
	class UCheatManagerExtension : public UObject
	{
	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"CheatManagerExtension">();
		}
	};

	// 0x0118 (0x08A0 - 0x0788)
	class ADebugCameraController : public APlayerController
	{
	public:
		uint8 Pad_ADebugCameraController[0x118];                                     // 0x0868(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"DebugCameraController">();
		}
	};


	// 0x0060 (0x0088 - 0x0028)
	class UCheatManager : public UObject
	{
	public:
		//uint8 Pad_UCheatManager_Class[0x60];
		class ADebugCameraController*				  DebugCameraControllerRef;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TSubclassOf<class ADebugCameraController>     DebugCameraControllerClass;                        // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_38[0x40];                                      // 0x0038(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
		TArray<class UCheatManagerExtension*>         CheatManagerExtensions;                            // 0x0078(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	/*public:
		void BugIt(const class FString& ScreenShotDescription);
		void BugItGo(float X, float Y, float Z, float Pitch, float Yaw, float Roll);
		void BugItStringCreator(const struct FVector& ViewLocation, const struct FRotator& ViewRotation, class FString* GoString, class FString* LocString);
		void ChangeSize(float F);
		void CheatScript(const class FString& ScriptName);
		void DamageTarget(float DamageAmount);
		void DebugCapsuleSweep();
		void DebugCapsuleSweepCapture();
		void DebugCapsuleSweepChannel(ECollisionChannel Channel);
		void DebugCapsuleSweepClear();
		void DebugCapsuleSweepComplex(bool bTraceComplex);
		void DebugCapsuleSweepPawn();
		void DebugCapsuleSweepSize(float HalfHeight, float Radius);
		void DestroyAll(TSubclassOf<class AActor> AClass);
		void DestroyAllPawnsExceptTarget();
		void DestroyPawns(TSubclassOf<class APawn> AClass);
		void DestroyServerStatReplicator();
		void DestroyTarget();
		void DisableDebugCamera();
		void DumpChatState();
		void DumpOnlineSessionState();
		void DumpPartyState();
		void DumpVoiceMutingState();
		void EnableDebugCamera();
		void FlushLog();
		void Fly();
		void FreezeFrame(float Delay);
		void Ghost();*/
		//void God();
		/*void InvertMouse();
		void LogLoc();
		void OnlyLoadLevel(class FName PackageName);
		void OnPlayerEndPlayed(class AActor* Player, EEndPlayReason EndPlayReason);
		void PlayersOnly();
		void ReceiveEndPlay();
		void ReceiveInitCheatManager();
		void ServerToggleAILogging();
		void SetMouseSensitivityToDefault();
		void SetWorldOrigin();
		void Slomo(float NewTimeDilation);
		void SpawnServerStatReplicator();
		void StreamLevelIn(class FName PackageName);
		void StreamLevelOut(class FName PackageName);
		void Summon(const class FString& ClassName);
		void Teleport();
		void TestCollisionDistance();
		void ToggleAILogging();*/
		//void ToggleDebugCamera();
		/*void ToggleServerStatReplicatorClientOverwrite();
		void ToggleServerStatReplicatorUpdateStatNet();
		void UpdateSafeArea();
		void ViewActor(class FName ActorName);
		void ViewClass(TSubclassOf<class AActor> DesiredClass);
		void ViewPlayer(const class FString& S);
		void ViewSelf();
		void Walk();*/

		//class APlayerController* GetPlayerController() const;

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"CheatManager">();
		}
	};


	// 0x0070 (0x02B8 - 0x0248)
	class APawn : public AActor
	{
	public:
		uint8 Pad_APawn_Class[0x70];
	};
	// 0x0248 (0x0500 - 0x02B8)
#pragma pack(push, 0x1)
	class alignas(0x10) ACharacter : public APawn
	{
	public:
		class USkeletalMeshComponent* Mesh; // 0x02B8(0x0008)
		uint8 Pad_ACharacter_Class[0x238]; // 0x2C0 240
	};
#pragma pack(pop)

	static_assert(offsetof(ACharacter, Mesh) == 0x2B8, "Bad alignment");
	static_assert(offsetof(ACharacter, Pad_ACharacter_Class) == 0x2C0, "Bad alignment");

	// 0x0080 (0x00A8 - 0x0028)
	class UActorComponent : public UObject
	{
	public:
		uint8 Pad_UActorComponent_Class[0x80];
		void Deactivate();
		bool IsActive() const;

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"ActorComponent">();
		}
	};
	// 0x0148 (0x01F0 - 0x00A8)
	class alignas(0x10) USceneComponent : public UActorComponent
	{
	public:
		uint8                                         Pad_382[0x148];
	public:
		struct FTransform K2_GetComponentToWorld() const;
		struct FTransform GetSocketTransform(class FName InSocketName, bool TransformSpace) const;
	};
	// 0x0280 (0x0470 - 0x01F0)
	class UPrimitiveComponent : public USceneComponent
	{
	public:
		uint8 Pad_UPrimitiveComponent_Class[0x280];
	};
	// 0x0040 (0x04B0 - 0x0470)
#pragma pack(push, 0x1)
	class alignas(0x10) UMeshComponent : public UPrimitiveComponent
	{
	public:
		uint8 Pad_UMeshComponent_Class[0x38];
	};
#pragma pack(pop)

	// 0x00A0 (0x00C8 - 0x0028)
	class UStreamableRenderAsset : public UObject
	{
	public:
		uint8 Pad_28[0xA0];
	};

	// 0x0008 (0x00D0 - 0x00C8)
	class USkinnedAsset : public UStreamableRenderAsset
	{
	public:
		uint8  Pad_C8[0x8];
	};

	struct FBoxSphereBounds final
	{
	public:
		struct FVector                                Origin;                                            // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                BoxExtent;                                         // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         SphereRadius;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	// 0x03C8 (0x0498 - 0x00D0)
	class USkeletalMesh : public USkinnedAsset
	{
	public:
		struct FBoxSphereBounds GetBounds() const;
	};

	// 0x02E0 (0x0790 - 0x04B0)
	class USkinnedMeshComponent : public UMeshComponent
	{
	public:
		uint8 Pad_Asset[0x8]; // 0x04A8
		class USkeletalMesh* SkeletalMesh; // 0x04B0
		uint8 Pad_BoneArray[0x60]; // 0x04B8 0x60 <-- In Dumped SDK the class starts at 0x4B0 but the first field is listed as starting at 0x4A8? 
		TArray<FTransform> BoneArray; // 0x0518(0x0010)
		uint8 Pad_USkinnedMeshComponent_Class[0x268]; // 0x0528 
		class FName GetBoneName(int32 BoneIndex) const;
		int32 GetNumBones() const;
	};
	// 0x0690 (0x0E20 - 0x0790)
	class USkeletalMeshComponent : public USkinnedMeshComponent
	{
	public:
		class USkeletalMesh* SkeletalMeshAsset; // 0x0790(0x0008)
		uint8 Pad_USkeletalMeshComponent[0x688]; // 0x0798 
	};
	// 0x0000 (0x0028 - 0x0028)
	class UBlueprintFunctionLibrary : public UObject
	{
	};
	// 0x0000 (0x0028 - 0x0028)
	class UGameplayStatics final : public UBlueprintFunctionLibrary
	{
	public:
		static class APlayerController* GetPlayerController(const class UObject* WorldContextObject, int32 PlayerIndex);
		static bool ProjectWorldToScreen(class APlayerController* Player, const struct FVector& WorldPosition, struct FVector2D* ScreenPosition, bool bPlayerViewportRelative);
		static double GetWorldDeltaSeconds(const class UObject* WorldContextObject);
		static class UObject* SpawnObject(TSubclassOf<class UObject> ObjectClass, class UObject* Outer_0);


	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"GameplayStatics">();
		}
		static class UGameplayStatics* GetDefaultObj()
		{
			return GetDefaultObjImpl<UGameplayStatics>();
		}
	};
	// 0x0000 (0x0028 - 0x0028)
	class UKismetMathLibrary final : public UBlueprintFunctionLibrary
	{
	public:
		static struct FTransform Conv_MatrixToTransform(const struct FMatrix& InMatrix);
		static struct FMatrix Conv_TransformToMatrix(const struct FTransform& Transform);
		static struct FRotator FindLookAtRotation(const struct FVector& Start, const struct FVector& Target);
		static struct FMatrix Multiply_MatrixMatrix(const struct FMatrix& A, const struct FMatrix& B);
		static struct FRotator RInterpTo(const struct FRotator& Current, const struct FRotator& Target, float DeltaTime, float InterpSpeed);
		static double Distance2D(const struct FVector2D& V1, const struct FVector2D& V2);

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"KismetMathLibrary">();
		}
		static class UKismetMathLibrary* GetDefaultObj()
		{
			return GetDefaultObjImpl<UKismetMathLibrary>();
		}
	};
	// 0x02A8 (0x02D0 - 0x0028)
	class UCanvas final : public UObject
	{
	public:
		float                                         OrgX; // 0x0028(0x0004)
		float                                         OrgY; // 0x002C(0x0004)
		float                                         ClipX; // 0x0030(0x0004)
		float                                         ClipY; // 0x0034(0x0004)
		uint8                                         Pad_SizeX[0x8]; // 0x38
		int32                                         SizeX; // 0x0040(0x0004)
		int32                                         SizeY; // 0x0044(0x0004)
		uint8                                         Pad_UCanvas_Class[0x288]; // 0x48

		void K2_DrawLine(const struct FVector2D& ScreenPositionA, const struct FVector2D& ScreenPositionB, float Thickness, const struct FLinearColor& RenderColor);
		void K2_DrawText(class UFont* RenderFont, const class FString& RenderText, const struct FVector2D& ScreenPosition, const struct FVector2D& Scale, const struct FLinearColor& RenderColor, float Kerning, const struct FLinearColor& ShadowColor, const struct FVector2D& ShadowOffset, bool bCentreX, bool bCentreY, bool bOutlined, const struct FLinearColor& OutlineColor);

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"Canvas">();
		}
		static class UCanvas* GetDefaultObj()
		{
			return GetDefaultObjImpl<UCanvas>();
		}
	};
	// 0x01E0 (0x0428 - 0x0248)
	class AWorldSettings : public AInfo
	{
	public:
		uint8 Pad_TimeDilation[0x130]; // 0x248
		float TimeDilation; // 0x0378(0x0004)
		uint8 Pad_AWorldSettings[0xAC]; // 0x037C
	};
	// 0x01A8 (0x01D0 - 0x0028)
	class UFont final : public UObject
	{
	public:
		uint8                                         Pad_UFont[0x1A8]; // 0x0028(0x0008)
	};

	// Class GameplayTasks.GameplayTasksComponent
	// 0x0078 (0x0120 - 0x00A8)
	class UGameplayTasksComponent : public UActorComponent
	{
	public:
		uint8                                         Pad_A8[0x14];                                      // 0x00A8(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
		uint8                                         BitPad_BC_0 : 1;                                   // 0x00BC(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
		uint8                                         bIsNetDirty : 1;                                   // 0x00BC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
		uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
		TArray<class UGameplayTask*>                  TaskPriorityQueue;                                 // 0x00C0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
		uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
		TArray<class UGameplayTask*>                  TickingTasks;                                      // 0x00E0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
		TArray<class UGameplayTask*>                  KnownTasks;                                        // 0x00F0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
		TMulticastInlineDelegate<void(const struct FGameplayResourceSet& NewlyClaimed, const struct FGameplayResourceSet& FreshlyReleased)> OnClaimedResourcesChange;                          // 0x0100(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
		TArray<class UGameplayTask*>                  SimulatedTasks;                                    // 0x0110(0x0010)(Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"GameplayTasksComponent">();
		}
		static class UGameplayTasksComponent* GetDefaultObj()
		{
			return GetDefaultObjImpl<UGameplayTasksComponent>();
		}
	};



	enum class EM1OnlineServiceConnectionState : uint8
	{
		NotLoggedIn = 0,
		RequestedLogIn = 1,
		ReceivedLogInButNotJoined = 2,
		RequestedJoinGame = 3,
		InTransitionMapToJoinGame = 4,
		ReceivedJoinGame = 5,
		JoinedDedicatedServer = 6,
		ReceivedLoginIdFromDedicatedServer = 7,
		RequestedPlayerCharacterInfoByLoginId = 8,
		SentPlayerPawnToClient = 9,
		ReceivedPawnAndOkay = 10,
		EM1OnlineServiceConnectionState_MAX = 11,
	};
	// 0x0108 (0x02C8 - 0x01C0)
	class UM1GameInstance : public UGameInstance
	{
	public:
		EM1OnlineServiceConnectionState ConnectionState; // 0x01C0(0x0001)
		uint8 Pad_UM1GameInstance[0x107]; // 0x01C1

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1GameInstance">();
		}
		static class UM1GameInstance* GetDefaultObj()
		{
			return GetDefaultObjImpl<UM1GameInstance>();
		}
	};

	enum class EM1MouseVisibilityFlag : uint8
	{
		None = 0,
		VirtualCursor = 1,
		GameContentSelector = 2,
		Cinematic = 4,
		RingMenuOnGamepad = 8,
		LoginMenuWaitInput = 16,
		Navigation = 32,
		UICaptureMode = 64,
		PhotoModeOnGamepad = 128,
		Visible = 255,
		EM1MouseVisibilityFlag_MAX = 256,
	};
	DEFINE_ENUM_FLAG_OPERATORS(EM1MouseVisibilityFlag)

	enum class EM1InputMethod : uint8
	{
		MouseAndKeyboard = 0,
		GamepadXBOX = 1,
		GamepadPS = 2,
		EM1InputMethod_MAX = 3,
	};

	enum class EM1InputControlMode : uint8
	{
		VirtualCursor = 0,
		Navigation = 1,
		EM1InputControlMode_MAX = 2,
	};

	enum class EM1MouseCursorStateFlag : uint8
	{
		Default = 0,
		Hover = 1,
		PickAndDrag = 2,
		EM1MouseCursorStateFlag_MAX = 3,
	};

	// 0x00E8 (0x0110 - 0x0028)
	class UM1InputSubsystem final : public UObject
	{
	public:
		uint8 Pad_28[0x30];                            // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
		EM1InputMethod CurrentInputMethod;             // 0x0058(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		EM1InputMethod LastControlledGamepad;          // 0x0059(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		EM1InputControlMode InputControlMode;          // 0x005A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8 Pad_5A[0x85];                            // 0x005B(0x0076)(Fixing Size After Last Property [ Dumper-7 ])
		bool bBlockUpdateCursors;                      // 0x00E0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		bool bBlockNavigationStart;                    // 0x00E1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		EM1MouseVisibilityFlag MouseVisibilityFlag;    // 0x00E2(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		EM1MouseCursorStateFlag MouseCursorStateFlag;  // 0x00E3(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8 Pad_UM1InputSubsystem[0x2C];             // 0x00E4
	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1InputSubsystem">();
		}
	};

	struct FM1TemplateId final
	{
	public:
		int32 ID; // 0x0000(0x0004)
	};

	// 0x0188 (0x0910 - 0x0788)
	class AM1PlayerController : public APlayerController
	{
	public:
		uint8 Pad_ActorManager[0x78]; // 0x788
		class UM1ActorManagerSubsystem* ActorManager_Subsystem; // 0x0800(0x0008)
		uint8 Pad_PrivateOnlineServComp[0x10];
		class UM1PrivateOnlineServiceComponent* PrivateOnlineServiceComponent; // 0x0818(0x0008)
		uint8 Pad_AM1PlayerController_Class[0xF0]; // 0x820

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1PlayerController">();
		}
		static class AM1PlayerController* GetDefaultObj()
		{
			return GetDefaultObjImpl<AM1PlayerController>();
		}
	};

	enum class EM1PresetSlotType : uint8
	{
		Ranged_0 = 0,
		Ranged_1 = 1,
		Ranged_2 = 2,
		Reactor = 9,
		Necklace = 10,
		Earring = 11,
		Ring = 12,
		Bracelet = 13,
		Face = 20,
		Hair = 21,
		Fellow = 70,
		PlayerCharacter = 80,
		AltWeapon = 90,
		PickupWeapon = 91,
		Max = 99,
	};

	struct FM1PresetSlot final
	{
	public:
		int32                                         PresetIndex;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
		class FString                                 PresetName;                                        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_5[0x50];
		//TMap<EM1PresetSlotType, struct FM1PresetItem> PresetItemBySlotType;                              // 0x0018(0x0050)(NativeAccessSpecifierPublic)
	};

	// 0x0050 (0x0078 - 0x0028)
	class UM1AccountPreset final : public UObject
	{
	public:
		TMap<int32, struct FM1PresetSlot>             PresetSlotByIndex;                                 // 0x0028(0x0050)(NativeAccessSpecifierPrivate)

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1AccountPreset">();
		}
	};

	// 0x00C8 (0x00F0 - 0x0028)
	class UM1AccountCharacter : public UObject
	{
	public:
		__int64 CharacterUniqueId; // 0x0028(0x0008)
		FM1TemplateId CharacterTid; // 0x0030(0x0004)
		uint8 Pad_Name[0x4]; // 0x0034
		FString Name; // 0x0038(0x0010)
		__int64 CombatPower; // 0x0048(0x0008)
		FDateTime CreatedTime; // 0x0050(0x0008)
		__int64 PlayTime; // 0x0058(0x0008)
		uint8 Pad_UM1AccountCharacter[0x90]; // 0x0060
	};

	enum class EM1CustomizingCharacterSkinType : uint8
	{
		None = 0,
		Head = 1,
		Body = 2,
		BackAttachment = 3,
		ChestAttachment = 4,
		Makeup = 5,
		Spawn = 6,
		EM1CustomizingCharacterSkinType_MAX = 7,
	};

	struct FM1CustomizeCharacterInfo final
	{
	public:
		struct FM1TemplateId                          CharacterTid;                                      // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
		TMap<EM1CustomizingCharacterSkinType, struct FM1TemplateId> SkinTids;                                          // 0x0008(0x0050)(NativeAccessSpecifierPublic)
	};

	struct FM1CustomizeInfos final
	{
	public:
		TMap<struct FM1TemplateId, struct FM1CustomizeCharacterInfo> Characters;                                        // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	};

	class UM1AccountInventoryBase : public UObject
	{
	};

	class UM1AccountInventory final : public UM1AccountInventoryBase
	{
	public:
		uint8 Pad_CustomizeEquipped[0x60];
		struct FM1CustomizeInfos                      CustomizeEquipped;                                 // 0x0088(0x0330)(NativeAccessSpecifierPrivate)
	};

	class UM1Account : public UObject
	{
	public:
		__int64 AccountUid;
		FString LoginID;
		FString SimpleID;
		FString Token;
		__int64 NPSN;
		FString ConnectedGameServerIP;
		int ConnectedGameServerPort;
		int ConnectedGameServerIndex;
		FString ConnectedGameServerVersion;
		FString CountryName;
		FString DeviceName;
		FString OsType;
		FString OsName;
		FString ServiceId;
		FString RegionId;
		FString FieldSessionId;
		byte LoginPlatformType;
		FString LoginPlatformOnlineId;
		__int64 LoginPlatformUid;
		bool bCreator;
		bool bJoinedGame;
		bool bJustFinishedPrologue;
		TMap<FM1TemplateId, UM1AccountCharacter*> AllCharacters;
		UM1AccountCharacter* SelectedCharacter;
		__int64 ExtendedCharacterSlotCount;		// 0x180
		class UM1AccountInventory* Inventory;	// 0x0188(0x0008)
		uint8 Pad_UM1AccountPreset[0x168];		// 0x190
		UM1AccountPreset* Preset; // 0x2F8
	};



	// 0x0020 (0x00C8 - 0x00A8)
	class UM1ActorComponent : public UActorComponent
	{
	public:
		uint8 Pad_UM1ActorComp_Class[0x20];
	};

	enum class EM1PlayerCustomizeType : uint8
	{
		Beard = 0,
		Eyebrow = 1,
		EM1PlayerCustomizeType_MAX = 2,
	};

	struct FM1PlayerCustomizeInfo final
	{
	public:
		EM1PlayerCustomizeType                        Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
		TArray<struct FM1TemplateId>                  PaintArray;                                        // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	};

	struct FM1CustomizeEtcSkinData final
	{
	public:
		struct FM1TemplateId                          CustomizingTemplateId;                             // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                          bInitialSetup;                                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
	};

	// 0x0080 (0x0080 - 0x0000)
	struct FM1CustomizeSkinInfo final
	{
	public:
		struct FM1TemplateId                          SkinTid;                                           // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
		TArray<struct FM1TemplateId>                  PaintArray;                                        // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		TArray<struct FM1TemplateId>                  GlassPaintArray;                                   // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		TArray<struct FM1TemplateId>                  EmissivePaintArray;                                // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		TArray<struct FM1TemplateId>                  SubPaintArray;                                     // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		TArray<struct FM1TemplateId>                  SubGlassPaintArray;                                // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		TArray<struct FM1TemplateId>                  SubEmissivePaintArray;                             // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		TArray<struct FM1TemplateId>                  HairPaintArray;                                    // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		int32                                         EvolutionIdx;                                      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
	};

	struct FM1CustomizeCharacterSkinData final
	{
	public:
		struct FM1TemplateId                          CharacterTid;                                      // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
		TArray<struct FM1CustomizeSkinInfo>           CustomizeSkinInfoArray;                            // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		TArray<struct FM1PlayerCustomizeInfo>         CharacterCustomizeInfoArray;                       // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		bool                                          bInitialSetup;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                          bVisiblePartsOff;                                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
	};

	enum class EM1CharacterMeshSlotType : uint8
	{
		None = 0,
		Head = 1,
		Body = 2,
		Face = 3,
		Back = 4,
		Chest = 5,
		SubBody = 6,
		EM1CharacterMeshSlotType_MAX = 7,
	};

	

	// 0x0018 (0x0040 - 0x0028)
	class UM1PrivateOnlineSubService : public UObject
	{
	public:
		uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
		bool                                          bIsReady;                                          // 0x0038(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
	};

	// 0x0118 (0x0140 - 0x0028)
	class UM1ResearchSystem final : public UObject
	{
	public:
		uint8                                         Pad_BookmarkResearchTids[0xA0];                    // 0x0028
		TArray<struct FM1TemplateId>                  BookmarkResearchTids;                              // 0x00C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
		uint8                                         Pad_UM1ResearchSystem[0x68];                       // 0x00D8

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1ResearchSystem">();
		}
	};

	// 0x0018 (0x0040 - 0x0028)
	class UM1MissionTaskService : public UObject
	{
	public:
		uint8                                         Pad_28[0x11];                                      // 0x0028
		bool                                          bJoined;                                           // 0x0039(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8                                         Pad_3A[0x6];                                       // 0x003A
	};

	// 0x0078 (0x00B8 - 0x0040)
	class UM1PrivateOnlineServicePreset final : public UM1PrivateOnlineSubService
	{
	public:
		uint8                                         Pad_40[0x78];                                      // 0x0040
	public:
		void ServerRequestApplyPreset(int32 InPresetIndex);
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1PrivateOnlineServicePreset">();
		}
	};

	// 0x08D8 (0x09A0 - 0x00C8)
	class UM1PrivateOnlineServiceComponent final : public UM1ActorComponent
	{
	public:
		TArray<class UM1PrivateOnlineSubService*> SubServices;			// 0x00C8(0x0010)
		uint8 Pad_CachedAccount[0x120];					// 0x00D8
		TWeakObjectPtr<class UM1Account> CachedAccount; // 0x01F8(0x0008)
		uint8 Pad_UM1PrivateOnlineServiceComponent_Class[0x8D0]; // 0x0200
		void ServerChangePlayer(const struct FM1TemplateId& InCharacterTid);
	};

	// 0x0060 (0x00A0 - 0x0040)
	class UM1PrivateOnlineServiceResearch final : public UM1PrivateOnlineSubService
	{
	public:
		uint8                                         Pad_UM1PrivateOnlineServiceResearch[0x60];                                      // 0x0040(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
	public:
		void ServerRequestStartResearch(const struct FM1TemplateId& InResearchTemplateId, int32 InRepeatCount);
	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1PrivateOnlineServiceResearch">();
		}
	};

	// 0x0080 (0x0128 - 0x00A8)
	class UM1HeartbeatTesterComponent final : public UActorComponent
	{
	public:
		uint8 Pad_2F4E[0x80];// 0x00A8(0x0080)
	};


	// Class M1.M1PlayerControllerInGame  															
	// 0x04A8 (0x0DB8 - 0x0910)
	class AM1PlayerControllerInGame : public AM1PlayerController
	{
	public:
		uint8 Pad_0910[0x088]; // 0x0910
		//class UM1OutOfPlayableAreaEffectComponent* OutOfPlayableAreaEffectComponent;  // 0x0990 //uint8 Pad_0B20[0x160];class UM1InstanceDungeonComponent* InstanceDungeonComponent;uint8 Pad_0C88[0x130];
		class UM1MultiSuppliierObtainComponent* MultiSupplierObtainComponent;        // 0x0998
		uint8 Pad_09A0[0x178]; // 0x09A0
		class UM1HeartbeatTesterComponent* HeartbeatTesterComponent;                // 0x0B18
		uint8 Pad_0B20[0x322]; // 0x0B20
	public:
		void ServerRequestFieldObjectDropItems(class AM1FieldInteractableActor* InActor);
		//class UM1DroppedItemObtainComponent* GetDroppedItemObtainComponent() const;
		//class UM1MultiSuppliierObtainComponent* GetMultiSupplierObtainComponent() const;
	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1PlayerControllerInGame">();
		}
	};
	// 0x0150 (0x0180 - 0x0030)
	class UM1ActorManagerSubsystem final : public UGameInstanceSubsystem
	{
	public:
		TArray<class AM1Character*> Characters; // 0x0030(0x0010)
		uint8 Pad_UM1ActorManagerSubsystem_Class[0x140];// 0x0040

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1ActorManagerSubsystem">();
		}
	};

	class UM1SpeedHackDetectorSubSystem final : public UGameInstanceSubsystem
	{
	public:
		uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
		int32                                         ServerHitchThreshholdCount;                        // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         ConsumeRoundsTimeDiscrepancyAllowanceRate;         // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         ClientTimeDiscrepancyAllowanceRate;                // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32                                         ConsumedRoundsTimeVerifierRequiredNums;            // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                          bUseDetect;                                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
		float                                         MaxFocusRestoreTime;                               // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		int32                                         MaxFalsePositive;                                  // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		float                                         ResetFalsePositiveTime;                            // 0x0054(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		int32                                         CurrFalsePositive;                                 // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		float                                         CurrFalsePositiveTime;                             // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		float                                         CurrFocusRestoreTime;                              // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		bool                                          bFocusRestore;                                     // 0x0064(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		bool                                          bTemperedTime;                                     // 0x0065(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		bool                                          bDetectedHookingTimer;                             // 0x0066(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
		float                                         SumOfDeltaTime;                                    // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		float                                         LastTimeSpanToSeconds;                             // 0x006C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	//public:
	//	void ServerFindSuspectedSpeedHackUser();

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1SpeedHackDetectorSubSystem">();
		}
	};

	// 0x0118 (0x0140 - 0x0028)
	class UM1CharacterAttribute : public UObject
	{
	public:
		uint8 UM1CharacterAttribute_Class[0x118];

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1CharacterAttribute">();
		}
	};

	// 0x00E8 (0x0228 - 0x0140)
	class UM1MonsterAttribute : public UM1CharacterAttribute
	{
	public:
		uint8 UM1MonsterAttribute_Class[0xE8];
	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1MonsterAttribute">();
		}
	};

	// 0x0770 (0x0C70 - 0x0500)
	class AM1Character : public ACharacter
	{
	public:
		uint8 Pad_InfoWidget[0x348]; // 0x4F8
		class UM1CharacterInfoWidgetComponent* InfoWidgetComponent; // 0x0840(0x0008) Need this
		uint8 Pad_StatComponent[0x18]; // 0x848
		class UM1StatComponent* StatComponent; // 0x0860(0x0008)
		class UM1AbilityComponent* AbilityComponent;                                  // 0x0868(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		uint8 Pad_CharacterAttribute[0x18]; // 0x870
		class UM1CharacterAttribute* CharacterAttribute;// 0x0888(0x0008)
		uint8 Pad_CharacterId[0x218]; // 0x890
		struct FM1TemplateId CharacterId; // 0x0AA8(0x0004) Need this
		uint8 Pad_AM1CharClass[0x1C4]; // 0xAAC

		bool IsDead() const;

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1Character">();
		}
	};
	// These show as errors but are correct when compiled
	//static_assert(offsetof(AM1Character, Pad_InfoWidget) == 0x4F8, "Bad alignment");
	//static_assert(offsetof(AM1Character, InfoWidgetComponent) == 0x7C8, "Bad alignment");
	//static_assert(offsetof(AM1Character, CharacterId) == 0x9F0, "Bad alignment");

	// ScriptStruct M1.InteractionCoolTimeInfo
	// 0x0010 (0x0010 - 0x0000)
	struct FInteractionCoolTimeInfo final
	{
	public:
		struct FM1TemplateId                          MultiSupplyId;                                     // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        ObjectUniqueID;                                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FDateTime                              NextCooltime;                                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	// Class M1.M1MultiSuppliierObtainComponent
	// 0x0028 (0x00F0 - 0x00C8)
	class UM1MultiSuppliierObtainComponent final : public UM1ActorComponent
	{
	public:
		TArray<struct FInteractionCoolTimeInfo>       NextInteractionCoolTimes;                          // 0x00C8(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
		uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

	public:
		//void OnRep_NextInteractionCoolTimes();
		void ServerRequestProcessInteraction(const struct FM1TemplateId& InTemplateId, uint32 InObjectUniqueID);

	public:
		static class UClass* StaticClass()
		{
			return StaticClassImpl<"M1MultiSuppliierObtainComponent">();
		}
		static class UM1MultiSuppliierObtainComponent* GetDefaultObj()
		{
			return GetDefaultObjImpl<UM1MultiSuppliierObtainComponent>();
		}
	};

	struct FM1VehicleMovementData final
	{
	public:
		float                                         MaxAcceleration;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         MaxSpeed;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         ForwardSpeedFactor;                                // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         BackwardSpeedFactor;                               // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         LateralSpeedFactor;                                // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         MaxTurnSpeed;                                      // 0x0014(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         Friction;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         ForwardFrictionFactor;                             // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         LateralFrictionFactor;                             // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         BrakingDeceleration;                               // 0x0024(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         MaxStepHeight;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         WalkableFloorAngle;                                // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         MaintainZMaxStepHeight;                            // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         MaintainZDuration;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         MaintainZRestoreCheckInterval;                     // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                         SmoothZSpeed;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         SmoothZSpeedCurve[0x8];
		//struct FRuntimeFloatCurve                     SmoothZSpeedCurve;                                 // 0x0040(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	};

	// 0x0018 (0x0018 - 0x0000)
	struct FM1CustomizeVehicleSkinData final
	{
	public:
		TArray<struct FM1CustomizeSkinInfo>           CustomizeSkinInfoArray;                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
